<template>
  <section
    class="flex justify-center items-center overflow-x-hidden relative h-[700px] mt-[500px] overflow-y-hidden ">
    <img src="/images/section7.png" alt="" class="absolute top-10 max-md:scale-x-150 max-md:scale-y-150" />
    <div class="flex mt-[150px] lg:mt-[480px] xl:mt-[400px] 2xl:mt-[500px] z-10 justify-center md:justify-between w-full lg:px-60 xl:px-44 flex-wrap px-7 max-md:gap-10">
      <div class="flex flex-col">
        <div class="grid place-items-center relative rounded-3xl bg-white shadow-xl shadow-gold/50 p-10">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="48"
            height="48"
            viewBox="0 0 48 48"
            fill="none">
            <g opacity="0.5">
              <path
                opacity="0.4"
                d="M43.2307 23.8463C43.2307 34.6449 34.4788 43.3948 23.6822 43.3948C12.8855 43.3948 4.13367 34.6449 4.13367 23.8463C4.13367 13.0516 12.8855 4.29779 23.6822 4.29779C34.4788 4.29779 43.2307 13.0516 43.2307 23.8463Z"
                fill="#1E2D48" />
              <path
                d="M30.6681 31.3031C30.412 31.3031 30.154 31.2367 29.9174 31.0979L22.2427 26.5196C21.8009 26.2537 21.5292 25.7748 21.5292 25.2587V15.3926C21.5292 14.5833 22.186 13.9265 22.9953 13.9265C23.8046 13.9265 24.4615 14.5833 24.4615 15.3926V24.426L31.4207 28.5761C32.1147 28.9925 32.3434 29.8917 31.929 30.5876C31.6533 31.047 31.1666 31.3031 30.6681 31.3031Z"
                fill="#1E2D48" />
            </g>
          </svg>
          <span
            class="absolute -bottom-3 bg-gold rounded-2xl font-bold text-white px-2 py-1"
            >218976</span
          >
        </div>
        <div class="text-center mt-5">ساعت آموزش</div>
      </div>
      <div class="flex flex-col md:pt-10">
        <div class="grid place-items-center relative rounded-3xl bg-white shadow-xl shadow-gold/50 p-10">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="48"
            height="48"
            viewBox="0 0 48 48"
            fill="none">
            <g opacity="0.5">
              <path
                opacity="0.4"
                d="M41.9248 14.9374C41.1057 14.4214 40.099 14.3757 39.2408 14.8124L36.3437 16.275C35.2724 16.8148 34.6077 17.9064 34.6077 19.121V30.5246C34.6077 31.7392 35.2724 32.8287 36.3437 33.3725L39.2388 34.8332C39.6318 35.0356 40.0521 35.1329 40.4724 35.1329C40.9767 35.1329 41.4772 34.99 41.9248 34.7101C42.7439 34.1961 43.2326 33.305 43.2326 32.3286V17.3209C43.2326 16.3445 42.7439 15.4534 41.9248 14.9374Z"
                fill="#1E2D48" />
              <path
                d="M23.4988 39.4853H12.1762C7.44155 39.4853 4.13586 36.2206 4.13586 31.5469V18.1011C4.13586 13.4253 7.44155 10.1626 12.1762 10.1626H23.4988C28.2335 10.1626 31.5392 13.4253 31.5392 18.1011V31.5469C31.5392 36.2206 28.2335 39.4853 23.4988 39.4853Z"
                fill="#1E2D48" />
            </g>
          </svg>
          <span
            class="absolute -bottom-3 bg-gold rounded-2xl font-bold text-white px-2 py-1"
            >114</span
          >
        </div>
        <div class="text-center mt-5">دوره آموزشی</div>
      </div>
      <div class="flex flex-col md:pt-10">
        <div class="grid place-items-center relative rounded-3xl bg-white shadow-xl shadow-gold/50 p-10">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="36"
            height="37"
            viewBox="0 0 36 37"
            fill="none">
            <g opacity="0.5">
              <path
                opacity="0.4"
                d="M33.9665 32.0941H22.835C21.7489 32.0941 20.8656 32.9914 20.8656 34.0947C20.8656 35.2 21.7489 36.0952 22.835 36.0952H33.9665C35.0525 36.0952 35.9358 35.2 35.9358 34.0947C35.9358 32.9914 35.0525 32.0941 33.9665 32.0941Z"
                fill="#1E2D48" />
              <path
                d="M15.0364 8.53937L25.5845 17.0627C25.8389 17.2665 25.8824 17.6406 25.6838 17.9012L13.1787 34.1955C12.3926 35.2021 11.2342 35.7716 9.993 35.7926L3.16642 35.8767C2.80234 35.8808 2.48377 35.6287 2.40102 35.2672L0.849525 28.5217C0.580599 27.2819 0.849525 26 1.63562 25.0123L14.2027 8.64024C14.4055 8.37756 14.7799 8.33133 15.0364 8.53937Z"
                fill="#1E2D48" />
              <path
                opacity="0.4"
                d="M30.3071 11.983L28.2736 14.5215C28.0688 14.78 27.7006 14.822 27.4462 14.616C24.9741 12.6155 18.644 7.48176 16.8877 6.0591C16.6312 5.84896 16.596 5.47491 16.8029 5.21434L18.764 2.7788C20.543 0.488263 23.646 0.278122 26.1491 2.27446L29.0245 4.565C30.2037 5.48962 30.9898 6.70844 31.2587 7.9903C31.569 9.40035 31.238 10.7852 30.3071 11.983Z"
                fill="#1E2D48" />
            </g>
          </svg>
          <span
            class="absolute -bottom-3 bg-gold rounded-2xl font-bold text-white px-2 py-1"
            >56</span
          >
        </div>
        <div class="text-center mt-5">آزمون مدون</div>
      </div>
      <div class="flex flex-col">
        <div class="grid place-items-center relative rounded-3xl bg-white shadow-xl shadow-gold/50 p-10">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="48"
            height="48"
            viewBox="0 0 48 48"
            fill="none">
            <g opacity="0.5">
              <path
                opacity="0.4"
                d="M36.9977 18.023C36.115 18.023 34.9459 18.0035 33.4903 18.0035C29.9404 18.0035 27.0215 15.0653 27.0215 11.4821V5.19531C27.0215 4.70073 26.6267 4.29803 26.137 4.29803H15.7969C10.9715 4.29803 7.07123 8.25856 7.07123 13.1125V34.176C7.07123 39.2684 11.1573 43.395 16.1996 43.395H31.5973C36.4054 43.395 40.3037 39.4599 40.3037 34.6021V18.9027C40.3037 18.4062 39.9108 18.0054 39.4191 18.0074C38.5926 18.0133 37.6016 18.023 36.9977 18.023Z"
                fill="#1E2D48" />
              <path
                opacity="0.4"
                d="M31.6715 5.40701C31.087 4.79905 30.0665 5.21739 30.0665 6.05993V11.2149C30.0665 13.3769 31.8474 15.1559 34.0095 15.1559C35.372 15.1715 37.2643 15.1754 38.8712 15.1715C39.6942 15.1695 40.1125 14.1862 39.5417 13.592C37.4793 11.4475 33.7866 7.60426 31.6715 5.40701Z"
                fill="#1E2D48" />
              <path
                d="M28.4149 29.5016C29.2183 29.5016 29.8713 30.1545 29.8713 30.9579C29.8713 31.7614 29.2183 32.4123 28.4149 32.4123H17.7727C16.9692 32.4123 16.3183 31.7614 16.3183 30.9579C16.3183 30.1545 16.9692 29.5016 17.7727 29.5016H28.4149ZM24.3897 19.7386C25.1931 19.7386 25.846 20.3916 25.846 21.195C25.846 21.9985 25.1931 22.6494 24.3897 22.6494H17.7725C16.969 22.6494 16.3181 21.9985 16.3181 21.195C16.3181 20.3916 16.969 19.7386 17.7725 19.7386H24.3897Z"
                fill="#1E2D48" />
            </g>
          </svg>
          <span
            class="absolute -bottom-3 bg-gold rounded-2xl font-bold text-white px-2 py-1"
            >1024</span
          >
        </div>
        <div class="text-center mt-5">سوال حقوقی</div>
      </div>
    </div>
  </section>
</template>
<style></style>
<script setup></script>
